>> SIENNA EAGAR: [02:07:29] Good evening. My name is Sienna Eagar. I am a Georgia native. A Georgia State University student and a District 5 resident. I am no outside agitator, and I'm here today to urge City Council to vote no on funding for the supposed police training facility known as Cop City or at the very least, send it back to committee for reconsideration. When it comes to people living in the United States opposing police forces in the United States, there's no such thing as an outside agitator. We all live in the same country. We all live in the same state and in the same city. So we have all seen the violence inflicted upon our black, brown, queer and trans siblings and upon our planet. If what the city of Atlanta really wants is to keep us safe, you should know that spending $67 million of our tax dollars on the destruction of Weelaunee forest and the construction of Cop City will never be what keeps us safe. The destruction of one of the four lungs of Atlanta would be detrimental to the city, causing further pollution of the South River, flooding the already underprivileged surrounding communities and further dirtying the air we breathe. We are not separate from this planet. We are the animals who inhabit it. We are the natural world, and the natural world is here in City Hall, begging you to do what you can to save it. $67 million should instead be invested in resources that take care of people and truly keep us safe. Healthcare, affordable housing, mental healthcare, community resources, rehabilitation and reintegration programs instead of prisons are all necessary alternatives to Cop City and to policing as it stands and to prevent crime in the first place. In the event that intervention is required in the midst of an ongoing violent crime, a service providing effective, specialized, rapid response does not need to be connected to a policing system that has been failing our community since its conception. Peaceful protesters have been wrongfully charged and arrested for domestic terrorism. Peaceful activist has been wrongfully charged for charity fraud. Peaceful protester, Tortuguita, was wrongfully murdered with no one held accountable nearly six months later. All for nothing. Democracy is meant to serve the will of the majority, not just the will of those with capital and power. We who are in nature defending itself. We are the majority. Please show us that you are listening. [02:09:30]
>> AUDIENCE MEMBERS: [02:09:30] [clapping] [02:09:30]
>> DOUG SHIPMAN: [02:09:31] Thank you. Priscilla Smith, you'll have up to two minutes. I'm also going to ask Councilmember Westmoreland to step back just for a few moments. Thank you. [02:09:43]
>> PRISCILLA SMITH: [02:09:44] I'm up? [02:09:44]
>> DOUG SHIPMAN: [02:09:45] To two minutes. [02:09:45]
>> PRISCILLA SMITH: [02:09:53] I don't have any substantive thing to add. Everybody has already said everything. But I'm sure I'm going to give you two minutes of my heart. I know many of you personally. I have spoken to you at great length, some of you. I find it difficult to believe that you are doing what you think is right when you vote yes on this. I ran for state House of Representatives and I got up to speak before the Kennesaw Business Association, and the words that came out of my mouth surprised me. They were that I knew, and everybody in the room knew that there was nothing wrong with the 2020 election. And I feel similarly right now. I don't quite know what happened to the things that I was going to say. But here we are. On March 7th of this year, I went over to Weelaunee and there I was a couple of decades older than everybody else. But there was a dance party. There was a music festival. Came back the next day. What I was going to do to be in support of the effort and time to go to rehearsal at 6:45, and there was suddenly police coming in. Wrapping people's wrists with zip ties and whatnot. The two young women that I was responsible for freaked out, ran back up the hill. We're trying to get down the hill. There are a few policemen looking at us. We don't know what's going on. I have the nerve to ask the police what to do. They say if you leave, nothing bad will happen. They said to me, yeah, we're scared. There are 600 of you and 44 of us. We can't be protected by people who are afraid of us. And building the Cop City will do nothing but inculcate that deeper into our culture. Thank you. [02:11:58]
>> AUDIENCE MEMBERS: [02:11:59] [cheering] [02:11:59]
>> DOUG SHIPMAN: [02:11:59] Thank you. Next speaker is Temperance Blike. Is Temperance here? Okay. And then followed by Rachel Smith and Kaitlyn Pitt. [02:12:16]
>> TEMPERANCE BLIKE: [02:12:17] The number? [02:12:17]
>> DOUG SHIPMAN: [02:12:17] Yeah. 178, 179 and 180. [02:12:19]
>> TEMPERANCE BLIKE: [02:12:19] Thank you. [02:12:19]
>> DOUG SHIPMAN: [02:12:20] You're welcome. [02:12:21]
