[
  {
    "id": "item_1",
    "text": "RACHEL ROSES: [8:17:03] My name is Rachel Roses, and I'm calling to support the public safety training center on field. It's a new distance. It's the perfect location. But this facility, not only environmentally, but also using the opportunity for local. Because of, you know, the community feel completely and are trying to police department to have the best place to be trained and compete in the we need be a to police, to expand, to do, well in the training and to have the perfect location. He found the quarry that he's racing in the city. We thank you for listening and we certainly hope my family in mind.\nAnd, you know. Support and public safety training center. Thank you. Really. Thank you. [8:18:14]"
  },
  {
    "id": "item_2",
    "text": "JACK MURPHY: [8:18:19] Hi. My name is Jack Murphy and I'm a resident of Green City Neighborhood. Hi, Howard. And I'm going to support for the public safety training center on Key Road. It is definitely needed. I see and ask all the council members to put on a public safety first and support this incredibly needed public safety training center for all those who live, work, play and try to upgrade. City of Green. Thank you. [8:18:47]"
  },
  {
    "id": "item_3",
    "text": "MAN #66: [8:18: 49] Yes. I'm calling in concerns, and, the city of Atlanta, weekly, said that, the results from hiring and structuring the facility could potentially, have included the community that is currently under being approved. Shortly before the mayor announced they were not running for another term. Or you can think of what do we know? I think for the environmental demonstration, that won't happen because we already know and how that money came in some decisions. And to be able to go through with the fighting for job creation of apron is unconscionable. And needless to say that a lot of the folks, especially in our community. And not been served by any of the ways, continue to train police, are essentially what we are having is a city that is reducing the economic opportunity for black, brown and white people. Well, I think generally making things more responsive to something like this during the pandemic, where it should no longer be short and where, as you know, you can't because in fact, the federal government can say, we're not you and you wonder why the Queen Street, and for some reason you believe that the police Washington other different element in the history of policing that people can implement. Can we please look at something we actually value? $90 million can go to the infinite amount of funding solutions and everything we can think of and value human life, and we can kind of sleep with your conscience. Thank you. [8:20:45]"
  }
]