[
  {
    "id": "item_1",
    "text": "COURTNEY: [00:07:11] Good afternoon. My name is Courtney, and I am an Atlanta police officer. I'm calling in support of the public Safety Training Center on Key Road. There's no question that we need the training center. And this is the only one viable location for it. APD have already been training here for many years, and it was the site of the original training center, they have continued to firing range and [indiscernible]. The city has done its due diligence and there are multiple reasons to vote yes on this location. There is not another location this facility could be built anytime in the near future. This is the most environmentally friendly option we are likely to see, and the city will be held to city standards and they have agreed to replace trees, including invasive species with high value hardwood trees. The project will open up trails and park land that have been fenced off to the public for years. [indiscernible]. We will be moving the financial burden from tax-payers shoulders, and opening up the possibility to more city funds to be spent on social service programs such as [indiscernible] that are high in our community. Private funding could go away, and taxpayers would then be forced to take on the burden at a later date. I personally find the [indiscernible]. We are short 400 police officers and 200 firefighters. This is the first class training facility that will enable us to effectively recruit, training, and sustain a full complement of officers who can be held to higher standards. Thank you. I urge you to vote yes. [00:09:06]"
  },
  {
    "id": "item_2",
    "text": "MARK: [00:09:08] My name Mark. I'm a retired Atlanta police after 30 years. [indiscernible]. This is really important in training our officers in today’s society. Thank you very much. Have a great night. [00:09:51]"
  },
  {
    "id": "item_3",
    "text": "DANIELLE LITTLEFIELD: [00:09:53] My name is Danielle Littlefield. Please vote no on cop city. Thank you. [00:09:57]"
  }
]
